PersonDataSecureClient/resources/soap-request.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
	<soapenv:Body>
		<ns1:PersonDataRequest xmlns:ns1="http://schemas.estudents.lk/xsd/persondata">
			<ns1:identificationNumber>1234567890v</ns1:identificationNumber>
		</ns1:PersonDataRequest>
	</soapenv:Body>
</soapenv:Envelope>